# 导入tkinter、random和time库
import tkinter as tk
import random
import time

# 创建一个列表，存储名字
name_list = ["化工2001 张印鹏", "化工2001 王涛", "化工2001 李瑞宝", "化工2001 梅庆瑞", "化工2001 邹晓旭", "化工2001 王宗钰", "化工2001 魏子洋", "化工2001 王宏伟", "化工2001 贾骜", "化工2001 宋武", "化工2001 董昊轩", "化工2001 白亚鹏", "化工2001 员紫坤", "化工2001 康校唯", "化工2001 赵永琪", "化工2001 王璞宇", "化工2001 李华月", "化工2001 魏钇汐", "化工2001 侯明昕", "化工2001 崔灿灿", "化工2001 朱世萌", "化工2001 娄新颖", "化工2001 商俊", "化工2001 张晓璇", "化工2001 刘文静", "化工2001 崔梓萌", "化工2001 段雅倩", "化工2001 慈秀敏", "化工2001 孙晓冉", "化工2002 贾晓凯", "化工2002 石文卓", "化工2002 渠浩", "化工2002 杨朔", "化工2002 王方翔", "化工2002 许路宁", "化工2002 王建飞", "化工2002 马仕博", "化工2002 张梓豪", "化工2002 王兆腾", "化工2002 赵俊博", "化工2002 马森淼", "化工2002 董昊天", "化工2002 陈诚", "化工2002 郑欣阳", "化工2002 肖静明", "化工2002 张金", "化工2002 朱冰娴", "化工2002 戎靖怡", "化工2002 翟海宁", "化工2002 王思媛", "化工2002 刘亚楠", "化工2002 赵怡喆", "化工2002 陈希钰", "化工2002 董莹莹", "化工2002 田洪如", "化工2002 裴洁璠", "化工2002 冯晓宇", "化工2002 赵紫瑶", "化工2002 兰杰", "化工2003 陈泽豪", "化工2003 张一凯", "化工2003 贾博昌", "化工2003 崔志远", "化工2003 王博", "化工2003 于欣宇", "化工2003 李保泽", "化工2003 何泽涛", "化工2003 于庆伟", "化工2003 张国江", "化工2003 崔培萱", "化工2003 李倬垚", "化工2003 唐志学", "化工2003 李婧怡", "化工2003 白伟欣", "化工2003 胡佳彤", "化工2003 李笑天", "化工2003 高泽玉", "化工2003 韩雅璐", "化工2003 毛润叶", "化工2003 程子琳", "化工2003 古佳册", "化工2003 李旭萌", "化工2003 张艺波", "化工2003 贺凡芮", "化工2003 张丹妮", "化工2003 张婷悦", "化工2004 刘志旺", "化工2004 安金涛", "化工2004 于梦强", "化工2004 冯庆奥", "化工2004 苗天润", "化工2004 李岩", "化工2004 姜永福", "化工2004 齐博宇", "化工2004 谷建程", "化工2004 郑学康", "化工2004 惠鹏超", "化工2004 张月魁", "化工2004 杨佳磊", "化工2004 胡彬", "化工2004 李裕", "化工2004 乔兵强", "化工2004 李朝倩", "化工2004 周鑫", "化工2004 秦陆迪", "化工2004 许卫娟", "化工2004 任敬研", "化工2004 邢赵彤", "化工2004 郭泽涵", "化工2004 石淼鑫", "化工2004 顾文静", "化工2004 张嘉核", "化工2004 王佳怡", "化工2004 董冬梅", "化工2004 魏雨婷", "化工2005 魏永豪", "化工2005 孙旺", "化工2005 董晨旭", "化工2005 李凯", "化工2005 郑依伟", "化工2005 孟庆林", "化工2005 张艺仁", "化工2005 李林卫", "化工2005 陈颢", "化工2005 杨鑫辉", "化工2005 李于康", "化工2005 刘钊钊", "化工2005 王丙阔", "化工2005 张洁", "化工2005 蒋盛业", "化工2005 闫俊典", "化工2005 李冉冉", "化工2005 宫慧杰", "化工2005 刘亚娟", "化工2005 王雅茜", "化工2005 刘金平", "化工2005 高骞", "化工2005 牛敬红", "化工2005 索肖瑶", "化工2005 郭佳琪", "化工2005 刘学阳", "化工2005 陈佳垚", "化工2005 白鑫宇"]

# 创建一个列表，存储颜色
color_list = ["red", "green", "blue", "yellow", "pink", "#00ff00", "#ff00ff"]

# 创建一个全局变量，用于记录是否停止更新的状态
stop = False


# 创建一个函数，用于随机选择并显示名字和颜色
def show_name():
    # 声明全局变量stop
    global stop, timer, name
    # 如果没有停止更新
    if not stop:
        # 从列表中随机选择一个名字和一个颜色
        name = random.choice(name_list)
        # color = random.choice(color_list)
        # 更新标签上的文本为选中的名字，并设置文本颜色为选中的颜色
        name_label.config(text=name, foreground="red")
        # 设置一个定时器，每隔1秒就调用这个函数，并将返回值赋给timer变量
        timer = window.after(70, show_name)


# 创建一个函数，用于切换停止更新的状态，并取消定时器
def toggle_stop():
    # 声明全局变量stop和timer
    global stop, timer
    # 如果没有停止更新，则停止更新，并取消定时器，并将按钮文本改为"开始更新"
    if not stop:
        stop = True
        window.after_cancel(timer)
        toggle_button.config(text="开始点名")
    # 否则，开始更新，并调用一次显示名字和颜色的函数，并将按钮文本改为"停止更新"
    else:
        stop = False
        show_name()
        name_list.remove(name)  # 将点过一次的名字从列表中删除
        toggle_button.config(text="开始点名")


# 创建一个窗口对象
window = tk.Tk()
# 设置窗口标题为"随机点名"
window.title("随机点名")
# 设置窗口大小为300x100像素
window.geometry("1500x400")

# 创建一个标签对象，用于显示名字和颜色
name_label = tk.Label(window, text="看看吧", font=("微软雅黑", 120))
# 将标签放置在窗口中央
name_label.pack()

# 调用一次显示名字和颜色的函数，开始更新标签上的名字和颜色，并将返回值赋给timer变量（这里假设timer已经定义过了）
timer = show_name()

# 创建一个按钮对象，用于切换停止更新的状态，并触发toggle_stop函数
toggle_button = tk.Button(window, text="开始点名", font=("微软雅黑", 50), width=10, height=1, bd=3, command=toggle_stop)
# 将按钮放置在窗口底部
toggle_button.pack(side=tk.BOTTOM)

# 进入主循环，等待用户操作
window.mainloop()
