import tkinter as tk
import random


class RollCallApp:

    def __init__(self, root):
        self.root = root
        self.root.title("随机点名程序")
        self.root.geometry("1400x450")  # 设置窗口大小

        # 初始化名字列表
        self.class1_names = [
            "化工2101 张少龙", "化工2101 霍双帅", "化工2101 贾子航", "化工2101 王栩",
            "化工2101 杨成杰", "化工2101 卢玲玲", "化工2101 王俊阳", "化工2101 张越",
            "化工2101 白会豪", "化工2101 王雨杰", "化工2101 王智宇", "化工2101 赵宏元",
            "化工2101 白松康", "化工2101 蔡畅", "化工2101 刘宇欣", "化工2101 麻斌栋",
            "化工2101 宋晓红", "化工2101 纪旭明", "化工2101 于增伟", "化工2101 高光耀",
            "化工2101 王腾雨", "化工2101 王航", "化工2101 王薪琦", "化工2101 褚升缘",
            "化工2101 戚晓贺", "化工2101 刘清波", "化工2101 郭康辉", "化工2101 刘梓源",
            "化工2101 刘钰涵", "化工2102 王少坤", "化工2102 郑树阳", "化工2102 郭天宇",
            "化工2102 郭子杭", "化工2102 李哲", "化工2102 刘初洋", "化工2102 乔毅恒",
            "化工2102 杨宏康", "化工2102 王亚卓", "化工2102 王泽森", "化工2102 谷佳柯",
            "化工2102 鲍元昊", "化工2102 高金瑞", "化工2102 冯兆琰", "化工2102 牛梦",
            "化工2102 苏江泽", "化工2102 袁子豪", "化工2102 冯继芳", "化工2102 李思洁",
            "化工2102 常煜杰", "化工2102 李嘉", "化工2102 迟阳", "化工2102 宋洪钊", "化工2102 马少涵",
            "化工2102 王是蛟", "化工2102 宁凡", "化工2102 赵丽敏", "化工2102 赵然", "化工2103 张天峰",
            "化工2103 段可欣", "化工2103 李佳诚", "化工2103 柳子康", "化工2103 朱嘉硕",
            "化工2103 齐佳蕊", "化工2103 梁禹浩", "化工2103 王广宠", "化工2103 张世纹",
            "化工2103 边仕岐", "化工2103 耿宇凡", "化工2103 李君倩", "化工2103 赵捷", "化工2103 王璐",
            "化工2103 王艺霏", "化工2103 张影", "化工2103 楚鹏铖", "化工2103 范雪云",
            "化工2103 尤熙蕾", "化工2103 刘洪江", "化工2103 王禹", "化工2103 王洋", "化工2103 董帅豪",
            "化工2103 刘嘉琪", "化工2103 毛晗", "化工2103 庞毅乐", "化工2103 刘畅", "化工2103 辛苑涛",
            "化工2103 李晴", "化工2104 刘鑫宇", "化工2104 尹兆闯", "化工2104 柴婉", "化工2104 井海盼",
            "化工2104 刘英英", "化工2104 刘文卓", "化工2104 王欣然", "化工2104 孔维浩",
            "化工2104 姚宇凡", "化工2104 翟宏池", "化工2104 张岩", "化工2104 郝思旭",
            "化工2104 常大帅", "化工2104 耿雨森", "化工2104 赵海月", "化工2104 毕泽华",
            "化工2104 王国峰", "化工2104 王晗", "化工2104 于博", "化工2104 张自乾", "化工2104 刘雨欣",
            "化工2104 谭晨曦", "化工2104 王奕婷", "化工2104 陈梦瑶", "化工2104 郭瑞鹏",
            "化工2104 侯占博", "化工2104 王雅彤", "化工2104 付家合", "化工2104 董晓冉",
            "化工2105 贾晨阳", "化工2105 李胜贤", "化工2105 徐博", "化工2105 田雅静",
            "化工2105 王子微", "化工2105 杜晶晶", "化工2105 韩记阳", "化工2105 李文博",
            "化工2105 王子轩", "化工2105 代若琰", "化工2105 魏琪琪", "化工2105 张雨欣",
            "化工2105 陈冬旭", "化工2105 赵世杰", "化工2105 韩琦", "化工2105 张裕", "化工2105 齐欣怡",
            "化工2105 王天义", "化工2105 张宝胜", "化工2105 张泽", "化工2105 卢梦萱",
            "化工2105 李曜航", "化工2105 李泽安", "化工2105 周轶群", "化工2105 马禹彤",
            "化工2105 耿思雨", "化工2105 蔡佳硕", "化工2105 王科宇"
        ]
        self.class2_names = [
            "食工2201 杨鑫华", "食工2201 李绍磊", "食工2201 邓东昊", "食工2201 高宇",
            "食工2201 李政达", "食工2201 张钰涵", "食工2201 李炎杭", "食工2201 张玉明",
            "食工2201 李馨蕾", "食工2201 李灿", "食工2201 范亦雯", "食工2201 马茹沄",
            "食工2201 刘鑫雨", "食工2201 陈雨晴", "食工2201 王艺涵", "食工2201 么渴鑫",
            "食工2201 付彦宏", "食工2201 张萌萌", "食工2201 刘雅楠", "食工2201 程瑞瑞",
            "食工2201 王璐瑶", "食工2201 卢梦蝶", "食工2201 李紫嫣", "食工2201 甄雅微",
            "食工2201 刘学", "食工2201 梁晶", "食工2201 康淳钤", "食工2201 徐滢", "食工2201 宋思佳",
            "食工2201 张梦", "食工2202 陈国航", "食工2202 马名扬", "食工2202 杨乾", "食工2202 韩万顺",
            "食工2202 宋保阔", "食工2202 毕双振", "食工2202 邵帅佳", "食工2202 刘培壮",
            "食工2202 任秦", "食工2202 杜晨阳", "食工2202 李璐瑶", "食工2202 王子菁",
            "食工2202 马雨桐", "食工2202 王静然", "食工2202 赵雅慧", "食工2202 陈旭硕",
            "食工2202 李雪怡", "食工2202 程紫涵", "食工2202 冯雨", "食工2202 杨倩", "食工2202 马新怡",
            "食工2202 汪莹", "食工2202 王智君", "食工2202 曹萌", "食工2202 江宜萱", "食工2202 安怡敏",
            "食工2202 檀紫雨", "食工2202 廉博云", "食工2202 张怡", "食工2202 刘玉柳",
            "食工2203 刘重阳", "食工2203 赵子旭", "食工2203 郭仔恒", "食工2203 李沛衡",
            "食工2203 高膺凡", "食工2203 王青阳", "食工2203 王鑫", "食工2203 师雪媛",
            "食工2203 刘希雨", "食工2203 孙梦阳", "食工2203 王新阳", "食工2203 任团团",
            "食工2203 刘雅妮", "食工2203 吴梦然", "食工2203 王露妃", "食工2203 张曼娇",
            "食工2203 赵玉婷", "食工2203 马紫淇", "食工2203 张天瑶", "食工2203 和月园",
            "食工2203 温锡诺", "食工2203 赵陈雪", "食工2203 杨官哲", "食工2203 杨柳",
            "食工2203 王雨晴", "食工2203 陈宏", "食工2203 岳洋", "食工2203 周杨佳兰",
            "食工2203 赵露宜", "食工2204 张创业", "食工2204 刘朝阳", "食工2204 翟泽澳",
            "食工2204 张晓琪", "食工2204 杨浩然", "食工2204 高海鹏", "食工2204 王自得",
            "食工2204 周磊", "食工2204 李泽栩", "食工2204 武水晶", "食工2204 赵艺涵",
            "食工2204 石诗涵", "食工2204 张嘉仪", "食工2204 石雅琳", "食工2204 麻艳秋",
            "食工2204 孙晨辰", "食工2204 李罗南", "食工2204 遆萌", "食工2204 张倩楠",
            "食工2204 胡春媛", "食工2204 张子璇", "食工2204 李晨哲", "食工2204 康世欣",
            "食工2204 张晓溪", "食工2204 吴亚宁", "食工2204 马昕雨", "食工2204 叶璇",
            "食工2204 张欣彤", "食工2204 吴彤", "食工2204 张柏涵"
        ]
        self.class3_names = ["化药2306 陈家乐",  "化药2306 陈霜",  "化药2306 范小天",  "化药2306 高萌",  "化药2306 华俊杰",  "化药2306 解泽亚",  "化药2306 靳昭瑞",  "化药2306 康文佩",  "化药2306 刘冰",  "化药2306 刘孟萱",  "化药2306 刘韦翔",  "化药2306 刘子谦",  "化药2306 柳靖轩",  "化药2306 马志楠",  "化药2306 孙艺博",  "化药2306 王家帅",  "化药2306 王孟超",  "化药2306 王卿伟",  "化药2306 王紫阳",  "化药2306 谢鹏程",  "化药2306 邢晓霞",  "化药2306 徐博琪",  "化药2306 岳萌飞",  "化药2306 张春旭",  "化药2306 张汉泽",  "化药2306 张佳星",  "化药2306 张文杰",  "化药2306 张文胜",  "化药2306 张子洋",  "化药2306 赵烨恒",  "化药2307 柏天宇",  "化药2307 程爽",  "化药2307 董欣源",  "化药2307 窦雨婷",  "化药2307 段世航",  "化药2307 冯汇晨",  "化药2307 高家康",  "化药2307 郭薇齐",  "化药2307 李明正",  "化药2307 李子策",  "化药2307 梁嘉",  "化药2307 梁仕硕",  "化药2307 刘梦雨",  "化药2307 刘婉萧",  "化药2307 孙鸿岩",  "化药2307 王子怡",  "化药2307 肖祎泽",  "化药2307 肖雨晴",  "化药2307 杨炳东",  "化药2307 袁宇杭",  "化药2307 张佳贺",  "化药2307 张唯一",  "化药2307 张倚潼",  "化药2307 赵发",  "化药2307 赵文硕",  "化药2307 赵志鹏",  "化药2307 郑亚迪",  "化药2307 周东",  "化药2307 周文阔",  "化药2307 庄子墨",  "化药2308 董梦楠",  "化药2308 范佳琦",  "化药2308 冯思宇",  "化药2308 高存琳",  "化药2308 韩子烨",  "化药2308 何宇灵",  "化药2308 李春梦",  "化药2308 李浩然",  "化药2308 李凯琦",  "化药2308 李凯旋",  "化药2308 李若晗",  "化药2308 李松岭",  "化药2308 李子恒",  "化药2308 穆晨旭",  "化药2308 乔月婷",  "化药2308 孙凯文",  "化药2308 孙世昭",  "化药2308 田溪悦",  "化药2308 王帅",  "化药2308 王义伟",  "化药2308 王雨豪",  "化药2308 晏康怡",  "化药2308 杨之轩",  "化药2308 余菲",  "化药2308 张文虎",  "化药2308 张祎",  "化药2308 赵宁宁",  "化药2308 周玉洁",  "化药2308 左添浩",  "化药2309 曹佳琪",  "化药2309 陈奥亚",  "化药2309 陈云芳",  "化药2309 冯育才",  "化药2309 韩钰莹",  "化药2309 何佳萌",  "化药2309 霍紫印",  "化药2309 贾馨悦",  "化药2309 寇盈盈",  "化药2309 李宝恒",  "化药2309 李海洋",  "化药2309 李佳乐",  "化药2309 李韶涵",  "化药2309 李彤",  "化药2309 李梓彤",  "化药2309 刘凤琳",  "化药2309 刘天命",  "化药2309 刘雨珊",  "化药2309 路梓鸣",  "化药2309 牛孜硕",  "化药2309 王蔚晴",  "化药2309 武凯航",  "化药2309 邢伊瑾",  "化药2309 姚明杰",  "化药2309 张博宇",  "化药2309 张瑞宝",  "化药2309 张天赐",  "化药2309 张鑫德",  "化药2309 赵子阳",  "化药2309 周子恒",  "化药2310 安邦",  "化药2310 段海林",  "化药2310 方佳怡",  "化药2310 顾成杰",  "化药2310 郭知涵",  "化药2310 李思璇",  "化药2310 李宗翰",  "化药2310 李宗政",  "化药2310 刘畅",  "化药2310 刘佳悦",  "化药2310 刘坤林",  "化药2310 刘子路",  "化药2310 马啸天",  "化药2310 秦思彤",  "化药2310 孙博阳",  "化药2310 唐若浅",  "化药2310 王博",  "化药2310 王哲",  "化药2310 王紫琪",  "化药2310 夏博伟",  "化药2310 邢梦祺",  "化药2310 徐楠",  "化药2310 闫晨松",  "化药2310 杨鑫凯",  "化药2310 袁冰慧",  "化药2310 张殿超",  "化药2310 张雅煊",  "化药2310 张云倩",  "化药2310 张志航",  "化药2310 朱梓怡"
        ]

        # 初始化班级选择
        self.current_class = self.class1_names
        self.class_selector = tk.StringVar()
        self.class_selector.set("21化工")

        # 创建班级选择框
        class_menu = tk.OptionMenu(root, self.class_selector, "化工21", "食工22", "化药2306-2310")
        class_menu.config(font=("微软雅黑", 20))
        class_menu.pack()

        # 创建点名结果显示标签
        self.roll_call_label = tk.Label(root,
                                        text="",
                                        font=("微软雅黑", 120),
                                        foreground="red")
        self.roll_call_label.pack(pady=20)

        # 创建随机点名按钮
        self.roll_call_button = tk.Button(root,
                                          text="随机点名",
                                          font=("微软雅黑", 50),
                                          command=self.start_roll_call)
        self.roll_call_button.pack()

        # 初始化滚动显示的变量
        self.is_rolling = False

    def start_roll_call(self):
        if not self.is_rolling:
            self.is_rolling = True
            self.roll_call_button.config(text="停止点名", font=("微软雅黑", 50))
            self.roll_call()
        else:
            self.is_rolling = False
            self.roll_call_button.config(text="随机点名", font=("微软雅黑", 50))

    def roll_call(self):
        if self.is_rolling:
            # 根据班级选择更新当前班级名字列表
            selected_class = self.class_selector.get()
            if selected_class == "化工21":
                self.current_class = self.class1_names
            elif selected_class == "食工22":
                self.current_class = self.class2_names
            elif selected_class == "化药2306-2310":
                self.current_class = self.class3_names

            # 随机选择一个名字
            random_name = random.choice(self.current_class)

            # 显示名字
            self.roll_call_label.config(text=random_name)

            # 定期调用roll_call方法，模拟滚动显示效果
            self.root.after(80, self.roll_call)


if __name__ == "__main__":
    root = tk.Tk()
    app = RollCallApp(root)
    root.mainloop()
